Repository: eoan-ermine/curl-l10n
Catalog: source/*/libcurl.po
Languages: ru

source: No error
ru: Нет ошибки

source: Unsupported protocol
ru: Неподдерживаемый протокол

source: Failed initialization
ru: Ошибка инициализации

source: URL using bad/illegal format or missing URL
ru: Неверный или отсутствующий URL

source: A requested feature, protocol or option was not found built-in in this libcurl due to a build-time decision.
ru: Запрошенная функция, протокол или опция не включены в эту версию libcurl по причине решений, принятых при сборке.

source: Could not resolve proxy name
ru: Не удалось разрешить имя прокси

source: Could not resolve hostname
ru: Не удалось разрешить имя хоста

source: Could not connect to server
ru: Не удалось подключиться к серверу

source: Weird server reply
ru: Необычный ответ сервера

source: Access denied to remote resource
ru: Доступ к удалённому ресурсу запрещён

source: FTP: The server failed to connect to data port
ru: FTP: Сервер не смог подключиться к порту передачи данных

source: FTP: Accepting server connect has timed out
ru: FTP: Превышено время ожидания подключения сервера

source: FTP: The server did not accept the PRET command.
ru: FTP: Сервер не принял команду PRET.

source: FTP: unknown PASS reply
ru: FTP: неизвестный ответ на PASS

source: FTP: unknown PASV reply
ru: FTP: неизвестный ответ на PASV

source: FTP: unknown 227 response format
ru: FTP: неизвестный формат ответа 227

source: FTP: cannot figure out the host in the PASV response
ru: FTP: не удалось определить хост в ответе PASV

source: Error in the HTTP2 framing layer
ru: Ошибка в слое фрейминга HTTP/2

source: FTP: could not set file type
ru: FTP: не удалось установить тип файла

source: Transferred a partial file
ru: Передан неполный файл

source: FTP: could not retrieve (RETR failed) the specified file
ru: FTP: не удалось получить указанный файл (ошибка выполнения RETR)

source: Quote command returned error
ru: Команда Quote вернула ошибку

source: HTTP response code said error
ru: Код ответа HTTP указывает на ошибку

source: Failed writing received data to disk/application
ru: Не удалось записать полученные данные на диск или в приложение

source: Upload failed (at start/before it took off)
ru: Не удалось начать загрузку

source: Failed to open/read local data from file/application
ru: Не удалось открыть или прочитать локальные данные из файла/программы

source: Out of memory
ru: Недостаточно памяти

source: Timeout was reached
ru: Время ожидания истекло

source: FTP: command PORT failed
ru: FTP: команда PORT завершилась ошибкой

source: FTP: command REST failed
ru: FTP: команда REST завершилась ошибкой

source: Requested range was not delivered by the server
ru: Запрошенный диапазон не был предоставлен сервером

source: SSL connect error
ru: Ошибка подключения SSL

source: Could not resume download
ru: Не удалось возобновить загрузку

source: Could not read a file:// file
ru: Не удалось прочитать файл по протоколу file://

source: LDAP: cannot bind
ru: LDAP: не удалось выполнить привязку

source: LDAP: search failed
ru: LDAP: поиск завершился ошибкой

source: Operation was aborted by an application callback
ru: Операция была прервана обратным вызовом приложения

source: A libcurl function was given a bad argument
ru: Функции libcurl передан неверный аргумент

source: Failed binding local connection end
ru: Не удалось привязать локальный конец соединения

source: Number of redirects hit maximum amount
ru: Достигнуто максимальное количество перенаправлений

source: An unknown option was passed in to libcurl
ru: В libcurl передана неизвестная опция

source: Malformed option provided in a setopt
ru: Неверно сформированная опция в setopt

source: Server returned nothing (no headers, no data)
ru: Сервер не вернул ничего (ни заголовков, ни данных)

source: SSL crypto engine not found
ru: Криптографический движок SSL не найден

source: Can not set SSL crypto engine as default
ru: Не удалось установить криптографический движок SSL по умолчанию

source: Failed to initialise SSL crypto engine
ru: Не удалось инициализировать криптографический движок SSL

source: Failed sending data to the peer
ru: Не удалось отправить данные узлу

source: Failure when receiving data from the peer
ru: Ошибка при получении данных от узла

source: Problem with the local SSL certificate
ru: Проблема с локальным сертификатом SSL

source: Could not use specified SSL cipher
ru: Не удалось использовать указанный шифр SSL

source: SSL peer certificate or SSH remote key was not OK
ru: Сертификат SSL узла или удалённый ключ SSH некорректен

source: Problem with the SSL CA cert (path? access rights?)
ru: Проблема с сертификатом SSL CA (путь? права доступа?)

source: Unrecognized or bad HTTP Content or Transfer-Encoding
ru: Нераспознанный или неверный HTTP Content или Transfer-Encoding

source: Maximum file size exceeded
ru: Превышен максимальный размер файла

source: Requested SSL level failed
ru: Запрошенный уровень SSL не поддерживается

source: Failed to shut down the SSL connection
ru: Не удалось закрыть соединение SSL

source: Failed to load CRL file (path? access rights?, format?)
ru: Не удалось загрузить файл CRL (путь? права доступа? формат?)

source: Issuer check against peer certificate failed
ru: Проверка издателя сертификата узла завершилась ошибкой

source: Send failed since rewinding of the data stream failed
ru: Отправка не удалась из-за ошибки перемотки потока данных

source: Login denied
ru: Вход запрещён

source: TFTP: File Not Found
ru: TFTP: Файл не найден

source: TFTP: Access Violation
ru: TFTP: Нарушение прав доступа

source: Disk full or allocation exceeded
ru: Диск заполнен или превышено выделение памяти

source: TFTP: Illegal operation
ru: TFTP: Недопустимая операция

source: TFTP: Unknown transfer ID
ru: TFTP: Неизвестный идентификатор передачи

source: Remote file already exists
ru: Удалённый файл уже существует

source: TFTP: No such user
ru: TFTP: Пользователь не существует

source: Remote file not found
ru: Удалённый файл не найден

source: Error in the SSH layer
ru: Ошибка в слое SSH

source: Socket not ready for send/recv
ru: Сокет не готов для отправки/получения

source: RTSP CSeq mismatch or invalid CSeq
ru: RTSP: Несоответствие CSeq или неверный CSeq

source: RTSP session error
ru: Ошибка сессии RTSP

source: Unable to parse FTP file list
ru: Не удалось разобрать список файлов FTP

source: Chunk callback failed
ru: Ошибка обратного вызова фрагмента

source: The max connection limit is reached
ru: Достигнуто максимальное количество соединений

source: SSL public key does not match pinned public key
ru: Публичный ключ SSL не соответствует закреплённому ключу

source: SSL server certificate status verification FAILED
ru: Проверка статуса сертификата сервера SSL завершилась ошибкой

source: Stream error in the HTTP/2 framing layer
ru: Ошибка потока в слое фрейминга HTTP/2

source: API function called from within callback
ru: Функция API вызвана из обратного вызова

source: An authentication function returned an error
ru: Функция аутентификации вернула ошибку

source: HTTP/3 error
ru: Ошибка HTTP/3

source: QUIC connection error
ru: Ошибка соединения QUIC

source: proxy handshake error
ru: Ошибка рукопожатия прокси

source: SSL Client Certificate required
ru: Требуется сертификат клиента SSL

source: Unrecoverable error in select/poll
ru: Невосстановимая ошибка в select/poll

source: A value or data field grew larger than allowed
ru: Значение или поле данных превысило допустимый размер

source: ECH attempted but failed
ru: Попытка использования ECH завершилась ошибкой

source: Unknown error
ru: Неизвестная ошибка

source: Error
ru: Ошибка

source: Please call curl_multi_perform() soon
ru: Пожалуйста, вызовите curl_multi_perform() в ближайшее время

source: Invalid multi handle
ru: Неверный мультидескриптор

source: Invalid easy handle
ru: Неверный простой дескриптор

source: Internal error
ru: Внутренняя ошибка

source: Invalid socket argument
ru: Неверный аргумент сокета

source: Unknown option
ru: Неизвестная опция

source: The easy handle is already added to a multi handle
ru: Простой дескриптор уже добавлен в мультидескриптор

source: Wakeup is unavailable or failed
ru: Пробуждение недоступно или завершилось ошибкой

source: Unknown share option
ru: Неизвестная опция совместного использования

source: Share currently in use
ru: Совместное использование уже активно

source: Invalid share handle
ru: Неверный дескриптор совместного использования

source: Feature not enabled in this library
ru: Функция не включена в этой библиотеке

source: CURLSHcode unknown
ru: Неизвестный код ошибки CURLSHcode

source: An invalid CURLU pointer was passed as argument
ru: Передан неверный указатель CURLU в качестве аргумента

source: An invalid 'part' argument was passed as argument
ru: Передан неверный аргумент 'part'

source: Malformed input to a URL function
ru: Неверный ввод в функцию URL

source: Port number was not a decimal number between 0 and 65535
ru: Номер порта не является десятичным числом от 0 до 65535

source: Unsupported URL scheme
ru: Неподдерживаемая схема URL

source: URL decode error, most likely because of rubbish in the input
ru: Ошибка декодирования URL, скорее всего, из-за некорректного ввода

source: A memory function failed
ru: Ошибка функции работы с памятью

source: Credentials was passed in the URL when prohibited
ru: Учётные данные переданы в URL, когда это запрещено

source: An unknown part ID was passed to a URL API function
ru: Неизвестный идентификатор части передан в функцию URL API

source: No scheme part in the URL
ru: Отсутствует часть схемы в URL

source: No user part in the URL
ru: Отсутствует часть пользователя в URL

source: No password part in the URL
ru: Отсутствует часть пароля в URL

source: No options part in the URL
ru: Отсутствует часть опций в URL

source: No host part in the URL
ru: Отсутствует часть хоста в URL

source: No port part in the URL
ru: Отсутствует часть порта в URL

source: No query part in the URL
ru: Отсутствует часть запроса в URL

source: No fragment part in the URL
ru: Отсутствует часть фрагмента в URL

source: No zoneid part in the URL
ru: Отсутствует часть zoneid в URL

source: Bad login part
ru: Неверная часть логина

source: Bad IPv6 address
ru: Неверный адрес IPv6

source: Bad hostname
ru: Неверное имя хоста

source: Bad file:// URL
ru: Неверный URL file://

source: Unsupported number of slashes following scheme
ru: Неподдерживаемое количество слэшей после схемы

source: Bad scheme
ru: Неверная схема

source: Bad path
ru: Неверный путь

source: Bad fragment
ru: Неверный фрагмент

source: Bad query
ru: Неверный запрос

source: Bad password
ru: Неверный пароль

source: Bad user
ru: Неверный пользователь

source: libcurl lacks IDN support
ru: libcurl не поддерживает IDN

source: A value or data field is larger than allowed
ru: Значение или поле данных превышает допустимый размер

source: CURLUcode unknown
ru: Неизвестный код ошибки CURLUcode

source: Call interrupted
ru: Вызов прерван

source: Bad file
ru: Неверный файл

source: Bad access
ru: Неверный доступ

source: Bad argument
ru: Неверный аргумент

source: Invalid arguments
ru: Неверные аргументы

source: Out of file descriptors
ru: Исчерпаны файловые дескрипторы

source: Call would block
ru: Вызов заблокирует выполнение

source: Blocking call in progress
ru: Выполняется блокирующий вызов

source: Descriptor is not a socket
ru: Дескриптор не является сокетом

source: Need destination address
ru: Требуется адрес назначения

source: Bad message size
ru: Неверный размер сообщения

source: Bad protocol
ru: Неверный протокол

source: Protocol option is unsupported
ru: Опция протокола не поддерживается

source: Protocol is unsupported
ru: Протокол не поддерживается

source: Socket is unsupported
ru: Сокет не поддерживается

source: Operation not supported
ru: Операция не поддерживается

source: Address family not supported
ru: Семейство адресов не поддерживается

source: Protocol family not supported
ru: Семейство протоколов не поддерживается

source: Address already in use
ru: Адрес уже используется

source: Address not available
ru: Адрес недоступен

source: Network down
ru: Сеть недоступна

source: Network unreachable
ru: Сеть недостижима

source: Network has been reset
ru: Сеть была сброшена

source: Connection was aborted
ru: Соединение было прервано

source: Connection was reset
ru: Соединение было сброшено

source: No buffer space
ru: Нет места в буфере

source: Socket is already connected
ru: Сокет уже подключён

source: Socket is not connected
ru: Сокет не подключён

source: Socket has been shut down
ru: Сокет был закрыт

source: Too many references
ru: Слишком много ссылок

source: Timed out
ru: Время ожидания истекло

source: Connection refused
ru: Соединение отклонено

source: Loop??
ru: Цикл??

source: Name too long
ru: Имя слишком длинное

source: Host down
ru: Хост недоступен

source: Host unreachable
ru: Хост недостижим

source: Not empty
ru: Не пусто

source: Process limit reached
ru: Достигнут лимит процессов

source: Too many users
ru: Слишком много пользователей

source: Bad quota
ru: Неверная квота

source: Something is stale
ru: Что-то устарело

source: Remote error
ru: Удалённая ошибка

source: Disconnected
ru: Отключено

source: Winsock library is not ready
ru: Библиотека Winsock не готова

source: Winsock library not initialised
ru: Библиотека Winsock не инициализирована

source: Winsock version not supported
ru: Версия Winsock не поддерживается

source: Host not found
ru: Хост не найден

source: Host not found, try again
ru: Хост не найден, попробуйте снова

source: Unrecoverable error in call to nameserver
ru: Невосстановимая ошибка при обращении к серверу имён

source: No data record of requested type
ru: Нет записи данных запрошенного типа

source: Unknown error %d (%#x)
ru: Неизвестная ошибка %d (%#x)

source: Unknown error %d
ru: Неизвестная ошибка %d

source: SEC_E_ILLEGAL_MESSAGE (0x%08X) - This error usually occurs when a fatal SSL/TLS alert is received (e.g. handshake failed). More detail may be available in the Windows System event log.
ru: SEC_E_ILLEGAL_MESSAGE (0x%08X) - Эта ошибка обычно возникает при получении фатального предупреждения SSL/TLS (например, сбой рукопожатия). Дополнительные сведения могут быть доступны в журнале событий Windows.
